Others/o/CC-Mode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>CC-Mode</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="CC-Mode"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-11-21 16:22:10 CST"/>
<meta name="author" content="visayafan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>



</head>
<body>


<div id="content">
<h1 class="title">CC-Mode</h1>


<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/vf.css" />
<script src="../../Layout/JS/jquery_1.7.1.js"></script>
<script src="../../Layout/JS/bootstrap_old.js"></script>



<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Commands</a>
<ul>
<li><a href="#sec-1-1">1.1 indent</a></li>
<li><a href="#sec-1-2">1.2 comment</a></li>
<li><a href="#sec-1-3">1.3 movement</a></li>
<li><a href="#sec-1-4">1.4 Others</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Commands</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> indent</h3>
<div class="outline-text-3" id="text-1-1">

<ol>
<li>C-j newline-and-indent<br/>
</li>
<li>C-M-q c-indent-exp 此时光标必须在左括号上<br/>
</li>
<li>C-c C-q c-indent-defun 缩进函数/类/宏=&gt; C-M-h C-M-\<br/>
</li>
<li>C-M-\ indent-region<br/>
</li>
<li>C-M-h c-mark-function 标记函数<br/>
</li>
</ol>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> comment</h3>
<div class="outline-text-3" id="text-1-2">

<ol>
<li>C-c C-c comment-region<br/>
</li>
<li>M-; comment-dwin 在行尾插入注释<br/>
      C-u M-; 删除当前行注释<br/>
</li>
<li>M-j 新注释行<br/>
</li>
</ol>

</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> movement</h3>
<div class="outline-text-3" id="text-1-3">

<ol>
<li>C-M-a c-beginning-of-defun<br/>
</li>
<li>C-M-e c-end-of-defun<br/>
</li>
<li>M-a c-beginning-of-statement<br/>
</li>
<li>M-e C-end-of-statement<br/>
</li>
<li>C-c C-u c-up-conditional 预处理向前一个条件语句#elif，忽略#else<br/>
</li>
<li>M-x c-down-conditional<br/>
</li>
<li>M-x c-up-conditional-with-else 不忽略#else<br/>
</li>
<li>M-x c-down-conditional-with-else<br/>
</li>
</ol>

</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Others</h3>
<div class="outline-text-3" id="text-1-4">

<ol>
<li>C-c . c-set-style设置编程风格<br/>
</li>
<li>C-c C-\ c-blackslash-region 选中区域每行末尾插入/对齐/删除blackslash，对多行宏有用<br/>
</li>
</ol>

</div>
</div>
</div>
</div>

</body>
</html>
